In [167]:
import pandas as pd
import numpy as np

In [55]:
#Q2

d1={
    'A':['Aone','Atwo','Athree','Afour','Afive'],'B':['Bone','Btwo','Bthree','Bfour','Bfive'],
    'C':['Cone','Ctwo','Cthree','Cfour','Cfive']}
df1=pd.DataFrame(d1)
rows=len(df1.index)
rows
df1

        A       B       C
0    Aone    Bone    Cone
1    Atwo    Btwo    Ctwo
2  Athree  Bthree  Cthree
3   Afour   Bfour   Cfour
4   Afive   Bfive   Cfive

In [56]:
index_list=list(df1.index.values)
index_list
df1=df1.reindex(index_list[1:rows:2])
df1

       A      B      C
1   Atwo   Btwo   Ctwo
3  Afour  Bfour  Cfour

In [82]:
#Q3

df2=pd.DataFrame({'values':[1,20,30,40,50]})
df2

   values
0       1
1      20
2      30
3      40
4      50

In [83]:
print(df2.iloc[0:3].sum())

values    51
dtype: int64

In [113]:
#Q4 

df3=pd.DataFrame({'text':['hello there','how are you i am']})
df3

               text
0  hello there i Am
1  how are you i am

In [118]:
df3['Word_Count']=0
df3

               text  Word_Count
0  hello there i Am           0
1  how are you i am           0

In [119]:
for i in range(len(df3.index)):
    df3.loc[i,['Word_Count']]=len(df3['text'][i].split())
df3

               text  Word_Count
0  hello there i Am           4
1  how are you i am           5

In [123]:
#Q5

df3.size

4

In [124]:
df3.shape

(2, 2)

In [125]:
#Q7

df4=pd.DataFrame({'email':['raj@gmail.com','jack99@gmail.com']})
df4

              email
0     raj@gmail.com
1  jack99@gmail.com

In [134]:
for i in range(len(df4.index)):
    df4.loc[i,['user']]=(df4['email'][i].split('@')[0])
df4

              email    user
0     raj@gmail.com     raj
1  jack99@gmail.com  jack99

In [140]:
#Q8

df5=pd.DataFrame({'A':[3,8,6,2,9],
                 'B':[5,2,9,3,1],
                 'C':[1,7,4,5,2]})
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [157]:
df6=df5[(df5['A']>5) & (df5['B']<10)]
print(df6)
print(df5)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2
   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [166]:
#Q9 
print(df5.mean())
print(df5.std())
print(df5.median())

A    5.6
B    4.0
C    3.8
dtype: float64
A    3.049590
B    3.162278
C    2.387467
dtype: float64
A    6.0
B    3.0
C    4.0
dtype: float64

In [192]:
#Q10

df7=pd.DataFrame({
    'sales': np.random.randint(100,size=7)
})
df7

   sales
0     27
1      4
2     10
3     44
4     61
5     40
6     57

In [194]:
df7['mav']=df7['sales'].rolling(7).mean()
df7

   sales        mav
0     27        NaN
1      4        NaN
2     10        NaN
3     44        NaN
4     61        NaN
5     40        NaN
6     57  34.714286

In [235]:
#Q11

date=pd.Series(pd.date_range('2023-07-23','2023-07-30'))
days=date.dt.day_name()
df8=pd.DataFrame({
    'date':date,'day':days
})
df8

        date        day
0 2023-07-23     Sunday
1 2023-07-24     Monday
2 2023-07-25    Tuesday
3 2023-07-26  Wednesday
4 2023-07-27   Thursday
5 2023-07-28     Friday
6 2023-07-29   Saturday
7 2023-07-30     Sunday

In [243]:
#Q12

date=pd.Series(pd.date_range('2023-01-01','2023-02-27',freq='W'))
df9=pd.DataFrame({
    'date':date
})
df9

        date
0 2023-01-01
1 2023-01-08
2 2023-01-15
3 2023-01-22
4 2023-01-29
5 2023-02-05
6 2023-02-12
7 2023-02-19
8 2023-02-26

In [244]:
df9[(df9['date']>'2023-01-01') & (df9['date']<'2023-01-31')]

        date
1 2023-01-08
2 2023-01-15
3 2023-01-22
4 2023-01-29

In [ ]:
#Q13

#import pandas as pd